grevaillot/svd_tools/headers/ATSAM4SP32A/pioc.h
#pragma once 

/* --- PIOC: Parallel Input/Output Controller C --------------------- */

/** @defgroup pioc_registers Parallel Input/Output Controller C Register
@{*/

/** PIOC_PER PIO Enable Register **/
#define PIOC_PER			MMIO32(PIOC_BASE + 0x00)
/** PIOC_PDR PIO Disable Register **/
#define PIOC_PDR			MMIO32(PIOC_BASE + 0x04)
/** PIOC_PSR PIO Status Register **/
#define PIOC_PSR			MMIO32(PIOC_BASE + 0x08)
/** PIOC_OER Output Enable Register **/
#define PIOC_OER			MMIO32(PIOC_BASE + 0x10)
/** PIOC_ODR Output Disable Register **/
#define PIOC_ODR			MMIO32(PIOC_BASE + 0x14)
/** PIOC_OSR Output Status Register **/
#define PIOC_OSR			MMIO32(PIOC_BASE + 0x18)
/** PIOC_IFER Glitch Input Filter Enable Register **/
#define PIOC_IFER			MMIO32(PIOC_BASE + 0x20)
/** PIOC_IFDR Glitch Input Filter Disable Register **/
#define PIOC_IFDR			MMIO32(PIOC_BASE + 0x24)
/** PIOC_IFSR Glitch Input Filter Status Register **/
#define PIOC_IFSR			MMIO32(PIOC_BASE + 0x28)
/** PIOC_SODR Set Output Data Register **/
#define PIOC_SODR			MMIO32(PIOC_BASE + 0x30)
/** PIOC_CODR Clear Output Data Register **/
#define PIOC_CODR			MMIO32(PIOC_BASE + 0x34)
/** PIOC_ODSR Output Data Status Register **/
#define PIOC_ODSR			MMIO32(PIOC_BASE + 0x38)
/** PIOC_PDSR Pin Data Status Register **/
#define PIOC_PDSR			MMIO32(PIOC_BASE + 0x3c)
/** PIOC_IER Interrupt Enable Register **/
#define PIOC_IER			MMIO32(PIOC_BASE + 0x40)
/** PIOC_IDR Interrupt Disable Register **/
#define PIOC_IDR			MMIO32(PIOC_BASE + 0x44)
/** PIOC_IMR Interrupt Mask Register **/
#define PIOC_IMR			MMIO32(PIOC_BASE + 0x48)
/** PIOC_ISR Interrupt Status Register **/
#define PIOC_ISR			MMIO32(PIOC_BASE + 0x4c)
/** PIOC_MDER Multi-driver Enable Register **/
#define PIOC_MDER			MMIO32(PIOC_BASE + 0x50)
/** PIOC_MDDR Multi-driver Disable Register **/
#define PIOC_MDDR			MMIO32(PIOC_BASE + 0x54)
/** PIOC_MDSR Multi-driver Status Register **/
#define PIOC_MDSR			MMIO32(PIOC_BASE + 0x58)
/** PIOC_PUDR Pull-up Disable Register **/
#define PIOC_PUDR			MMIO32(PIOC_BASE + 0x60)
/** PIOC_PUER Pull-up Enable Register **/
#define PIOC_PUER			MMIO32(PIOC_BASE + 0x64)
/** PIOC_PUSR Pad Pull-up Status Register **/
#define PIOC_PUSR			MMIO32(PIOC_BASE + 0x68)
/** PIOC_ABCDSR[0] Peripheral Select Register **/
#define PIOC_ABCDSR[0]			MMIO32(PIOC_BASE + 0x70)
/** PIOC_ABCDSR[1] Peripheral Select Register **/
#define PIOC_ABCDSR[1]			MMIO32(PIOC_BASE + 0x74)
/** PIOC_IFSCDR Input Filter Slow Clock Disable Register **/
#define PIOC_IFSCDR			MMIO32(PIOC_BASE + 0x80)
/** PIOC_IFSCER Input Filter Slow Clock Enable Register **/
#define PIOC_IFSCER			MMIO32(PIOC_BASE + 0x84)
/** PIOC_IFSCSR Input Filter Slow Clock Status Register **/
#define PIOC_IFSCSR			MMIO32(PIOC_BASE + 0x88)
/** PIOC_SCDR Slow Clock Divider Debouncing Register **/
#define PIOC_SCDR			MMIO32(PIOC_BASE + 0x8c)
/** PIOC_PPDDR Pad Pull-down Disable Register **/
#define PIOC_PPDDR			MMIO32(PIOC_BASE + 0x90)
/** PIOC_PPDER Pad Pull-down Enable Register **/
#define PIOC_PPDER			MMIO32(PIOC_BASE + 0x94)
/** PIOC_PPDSR Pad Pull-down Status Register **/
#define PIOC_PPDSR			MMIO32(PIOC_BASE + 0x98)
/** PIOC_OWER Output Write Enable **/
#define PIOC_OWER			MMIO32(PIOC_BASE + 0xa0)
/** PIOC_OWDR Output Write Disable **/
#define PIOC_OWDR			MMIO32(PIOC_BASE + 0xa4)
/** PIOC_OWSR Output Write Status Register **/
#define PIOC_OWSR			MMIO32(PIOC_BASE + 0xa8)
/** PIOC_AIMER Additional Interrupt Modes Enable Register **/
#define PIOC_AIMER			MMIO32(PIOC_BASE + 0xb0)
/** PIOC_AIMDR Additional Interrupt Modes Disables Register **/
#define PIOC_AIMDR			MMIO32(PIOC_BASE + 0xb4)
/** PIOC_AIMMR Additional Interrupt Modes Mask Register **/
#define PIOC_AIMMR			MMIO32(PIOC_BASE + 0xb8)
/** PIOC_ESR Edge Select Register **/
#define PIOC_ESR			MMIO32(PIOC_BASE + 0xc0)
/** PIOC_LSR Level Select Register **/
#define PIOC_LSR			MMIO32(PIOC_BASE + 0xc4)
/** PIOC_ELSR Edge/Level Status Register **/
#define PIOC_ELSR			MMIO32(PIOC_BASE + 0xc8)
/** PIOC_FELLSR Falling Edge/Low Level Select Register **/
#define PIOC_FELLSR			MMIO32(PIOC_BASE + 0xd0)
/** PIOC_REHLSR Rising Edge/ High Level Select Register **/
#define PIOC_REHLSR			MMIO32(PIOC_BASE + 0xd4)
/** PIOC_FRLHSR Fall/Rise - Low/High Status Register **/
#define PIOC_FRLHSR			MMIO32(PIOC_BASE + 0xd8)
/** PIOC_LOCKSR Lock Status **/
#define PIOC_LOCKSR			MMIO32(PIOC_BASE + 0xe0)
/** PIOC_WPMR Write Protect Mode Register **/
#define PIOC_WPMR			MMIO32(PIOC_BASE + 0xe4)
/** PIOC_WPSR Write Protect Status Register **/
#define PIOC_WPSR			MMIO32(PIOC_BASE + 0xe8)
/** PIOC_SCHMITT Schmitt Trigger Register **/
#define PIOC_SCHMITT			MMIO32(PIOC_BASE + 0x100)
/** PIOC_PCMR Parallel Capture Mode Register **/
#define PIOC_PCMR			MMIO32(PIOC_BASE + 0x150)
/** PIOC_PCIER Parallel Capture Interrupt Enable Register **/
#define PIOC_PCIER			MMIO32(PIOC_BASE + 0x154)
/** PIOC_PCIDR Parallel Capture Interrupt Disable Register **/
#define PIOC_PCIDR			MMIO32(PIOC_BASE + 0x158)
/** PIOC_PCIMR Parallel Capture Interrupt Mask Register **/
#define PIOC_PCIMR			MMIO32(PIOC_BASE + 0x15c)
/** PIOC_PCISR Parallel Capture Interrupt Status Register **/
#define PIOC_PCISR			MMIO32(PIOC_BASE + 0x160)
/** PIOC_PCRHR Parallel Capture Reception Holding Register **/
#define PIOC_PCRHR			MMIO32(PIOC_BASE + 0x164)

/**@}*/


/** @defgroup pioc_per PER PIO Enable Register
@{*/

/** PIOC_PER_P31 PIO Enable **/
#define PIOC_PER_P31		(1 << 31)
/** PIOC_PER_P30 PIO Enable **/
#define PIOC_PER_P30		(1 << 30)
/** PIOC_PER_P29 PIO Enable **/
#define PIOC_PER_P29		(1 << 29)
/** PIOC_PER_P28 PIO Enable **/
#define PIOC_PER_P28		(1 << 28)
/** PIOC_PER_P27 PIO Enable **/
#define PIOC_PER_P27		(1 << 27)
/** PIOC_PER_P26 PIO Enable **/
#define PIOC_PER_P26		(1 << 26)
/** PIOC_PER_P25 PIO Enable **/
#define PIOC_PER_P25		(1 << 25)
/** PIOC_PER_P24 PIO Enable **/
#define PIOC_PER_P24		(1 << 24)
/** PIOC_PER_P23 PIO Enable **/
#define PIOC_PER_P23		(1 << 23)
/** PIOC_PER_P22 PIO Enable **/
#define PIOC_PER_P22		(1 << 22)
/** PIOC_PER_P21 PIO Enable **/
#define PIOC_PER_P21		(1 << 21)
/** PIOC_PER_P20 PIO Enable **/
#define PIOC_PER_P20		(1 << 20)
/** PIOC_PER_P19 PIO Enable **/
#define PIOC_PER_P19		(1 << 19)
/** PIOC_PER_P18 PIO Enable **/
#define PIOC_PER_P18		(1 << 18)
/** PIOC_PER_P17 PIO Enable **/
#define PIOC_PER_P17		(1 << 17)
/** PIOC_PER_P16 PIO Enable **/
#define PIOC_PER_P16		(1 << 16)
/** PIOC_PER_P15 PIO Enable **/
#define PIOC_PER_P15		(1 << 15)
/** PIOC_PER_P14 PIO Enable **/
#define PIOC_PER_P14		(1 << 14)
/** PIOC_PER_P13 PIO Enable **/
#define PIOC_PER_P13		(1 << 13)
/** PIOC_PER_P12 PIO Enable **/
#define PIOC_PER_P12		(1 << 12)
/** PIOC_PER_P11 PIO Enable **/
#define PIOC_PER_P11		(1 << 11)
/** PIOC_PER_P10 PIO Enable **/
#define PIOC_PER_P10		(1 << 10)
/** PIOC_PER_P9 PIO Enable **/
#define PIOC_PER_P9		(1 << 9)
/** PIOC_PER_P8 PIO Enable **/
#define PIOC_PER_P8		(1 << 8)
/** PIOC_PER_P7 PIO Enable **/
#define PIOC_PER_P7		(1 << 7)
/** PIOC_PER_P6 PIO Enable **/
#define PIOC_PER_P6		(1 << 6)
/** PIOC_PER_P5 PIO Enable **/
#define PIOC_PER_P5		(1 << 5)
/** PIOC_PER_P4 PIO Enable **/
#define PIOC_PER_P4		(1 << 4)
/** PIOC_PER_P3 PIO Enable **/
#define PIOC_PER_P3		(1 << 3)
/** PIOC_PER_P2 PIO Enable **/
#define PIOC_PER_P2		(1 << 2)
/** PIOC_PER_P1 PIO Enable **/
#define PIOC_PER_P1		(1 << 1)
/** PIOC_PER_P0 PIO Enable **/
#define PIOC_PER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pdr PDR PIO Disable Register
@{*/

/** PIOC_PDR_P31 PIO Disable **/
#define PIOC_PDR_P31		(1 << 31)
/** PIOC_PDR_P30 PIO Disable **/
#define PIOC_PDR_P30		(1 << 30)
/** PIOC_PDR_P29 PIO Disable **/
#define PIOC_PDR_P29		(1 << 29)
/** PIOC_PDR_P28 PIO Disable **/
#define PIOC_PDR_P28		(1 << 28)
/** PIOC_PDR_P27 PIO Disable **/
#define PIOC_PDR_P27		(1 << 27)
/** PIOC_PDR_P26 PIO Disable **/
#define PIOC_PDR_P26		(1 << 26)
/** PIOC_PDR_P25 PIO Disable **/
#define PIOC_PDR_P25		(1 << 25)
/** PIOC_PDR_P24 PIO Disable **/
#define PIOC_PDR_P24		(1 << 24)
/** PIOC_PDR_P23 PIO Disable **/
#define PIOC_PDR_P23		(1 << 23)
/** PIOC_PDR_P22 PIO Disable **/
#define PIOC_PDR_P22		(1 << 22)
/** PIOC_PDR_P21 PIO Disable **/
#define PIOC_PDR_P21		(1 << 21)
/** PIOC_PDR_P20 PIO Disable **/
#define PIOC_PDR_P20		(1 << 20)
/** PIOC_PDR_P19 PIO Disable **/
#define PIOC_PDR_P19		(1 << 19)
/** PIOC_PDR_P18 PIO Disable **/
#define PIOC_PDR_P18		(1 << 18)
/** PIOC_PDR_P17 PIO Disable **/
#define PIOC_PDR_P17		(1 << 17)
/** PIOC_PDR_P16 PIO Disable **/
#define PIOC_PDR_P16		(1 << 16)
/** PIOC_PDR_P15 PIO Disable **/
#define PIOC_PDR_P15		(1 << 15)
/** PIOC_PDR_P14 PIO Disable **/
#define PIOC_PDR_P14		(1 << 14)
/** PIOC_PDR_P13 PIO Disable **/
#define PIOC_PDR_P13		(1 << 13)
/** PIOC_PDR_P12 PIO Disable **/
#define PIOC_PDR_P12		(1 << 12)
/** PIOC_PDR_P11 PIO Disable **/
#define PIOC_PDR_P11		(1 << 11)
/** PIOC_PDR_P10 PIO Disable **/
#define PIOC_PDR_P10		(1 << 10)
/** PIOC_PDR_P9 PIO Disable **/
#define PIOC_PDR_P9		(1 << 9)
/** PIOC_PDR_P8 PIO Disable **/
#define PIOC_PDR_P8		(1 << 8)
/** PIOC_PDR_P7 PIO Disable **/
#define PIOC_PDR_P7		(1 << 7)
/** PIOC_PDR_P6 PIO Disable **/
#define PIOC_PDR_P6		(1 << 6)
/** PIOC_PDR_P5 PIO Disable **/
#define PIOC_PDR_P5		(1 << 5)
/** PIOC_PDR_P4 PIO Disable **/
#define PIOC_PDR_P4		(1 << 4)
/** PIOC_PDR_P3 PIO Disable **/
#define PIOC_PDR_P3		(1 << 3)
/** PIOC_PDR_P2 PIO Disable **/
#define PIOC_PDR_P2		(1 << 2)
/** PIOC_PDR_P1 PIO Disable **/
#define PIOC_PDR_P1		(1 << 1)
/** PIOC_PDR_P0 PIO Disable **/
#define PIOC_PDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_psr PSR PIO Status Register
@{*/

/** PIOC_PSR_P31 PIO Status **/
#define PIOC_PSR_P31		(1 << 31)
/** PIOC_PSR_P30 PIO Status **/
#define PIOC_PSR_P30		(1 << 30)
/** PIOC_PSR_P29 PIO Status **/
#define PIOC_PSR_P29		(1 << 29)
/** PIOC_PSR_P28 PIO Status **/
#define PIOC_PSR_P28		(1 << 28)
/** PIOC_PSR_P27 PIO Status **/
#define PIOC_PSR_P27		(1 << 27)
/** PIOC_PSR_P26 PIO Status **/
#define PIOC_PSR_P26		(1 << 26)
/** PIOC_PSR_P25 PIO Status **/
#define PIOC_PSR_P25		(1 << 25)
/** PIOC_PSR_P24 PIO Status **/
#define PIOC_PSR_P24		(1 << 24)
/** PIOC_PSR_P23 PIO Status **/
#define PIOC_PSR_P23		(1 << 23)
/** PIOC_PSR_P22 PIO Status **/
#define PIOC_PSR_P22		(1 << 22)
/** PIOC_PSR_P21 PIO Status **/
#define PIOC_PSR_P21		(1 << 21)
/** PIOC_PSR_P20 PIO Status **/
#define PIOC_PSR_P20		(1 << 20)
/** PIOC_PSR_P19 PIO Status **/
#define PIOC_PSR_P19		(1 << 19)
/** PIOC_PSR_P18 PIO Status **/
#define PIOC_PSR_P18		(1 << 18)
/** PIOC_PSR_P17 PIO Status **/
#define PIOC_PSR_P17		(1 << 17)
/** PIOC_PSR_P16 PIO Status **/
#define PIOC_PSR_P16		(1 << 16)
/** PIOC_PSR_P15 PIO Status **/
#define PIOC_PSR_P15		(1 << 15)
/** PIOC_PSR_P14 PIO Status **/
#define PIOC_PSR_P14		(1 << 14)
/** PIOC_PSR_P13 PIO Status **/
#define PIOC_PSR_P13		(1 << 13)
/** PIOC_PSR_P12 PIO Status **/
#define PIOC_PSR_P12		(1 << 12)
/** PIOC_PSR_P11 PIO Status **/
#define PIOC_PSR_P11		(1 << 11)
/** PIOC_PSR_P10 PIO Status **/
#define PIOC_PSR_P10		(1 << 10)
/** PIOC_PSR_P9 PIO Status **/
#define PIOC_PSR_P9		(1 << 9)
/** PIOC_PSR_P8 PIO Status **/
#define PIOC_PSR_P8		(1 << 8)
/** PIOC_PSR_P7 PIO Status **/
#define PIOC_PSR_P7		(1 << 7)
/** PIOC_PSR_P6 PIO Status **/
#define PIOC_PSR_P6		(1 << 6)
/** PIOC_PSR_P5 PIO Status **/
#define PIOC_PSR_P5		(1 << 5)
/** PIOC_PSR_P4 PIO Status **/
#define PIOC_PSR_P4		(1 << 4)
/** PIOC_PSR_P3 PIO Status **/
#define PIOC_PSR_P3		(1 << 3)
/** PIOC_PSR_P2 PIO Status **/
#define PIOC_PSR_P2		(1 << 2)
/** PIOC_PSR_P1 PIO Status **/
#define PIOC_PSR_P1		(1 << 1)
/** PIOC_PSR_P0 PIO Status **/
#define PIOC_PSR_P0		(1 << 0)

/**@}*/

