grevaillot/svd_tools/headers/ATSAM4SP32A/pioc.h
/** @defgroup pioc_sodr SODR Set Output Data Register
@{*/

/** PIOC_SODR_P31 Set Output Data **/
#define PIOC_SODR_P31		(1 << 31)
/** PIOC_SODR_P30 Set Output Data **/
#define PIOC_SODR_P30		(1 << 30)
/** PIOC_SODR_P29 Set Output Data **/
#define PIOC_SODR_P29		(1 << 29)
/** PIOC_SODR_P28 Set Output Data **/
#define PIOC_SODR_P28		(1 << 28)
/** PIOC_SODR_P27 Set Output Data **/
#define PIOC_SODR_P27		(1 << 27)
/** PIOC_SODR_P26 Set Output Data **/
#define PIOC_SODR_P26		(1 << 26)
/** PIOC_SODR_P25 Set Output Data **/
#define PIOC_SODR_P25		(1 << 25)
/** PIOC_SODR_P24 Set Output Data **/
#define PIOC_SODR_P24		(1 << 24)
/** PIOC_SODR_P23 Set Output Data **/
#define PIOC_SODR_P23		(1 << 23)
/** PIOC_SODR_P22 Set Output Data **/
#define PIOC_SODR_P22		(1 << 22)
/** PIOC_SODR_P21 Set Output Data **/
#define PIOC_SODR_P21		(1 << 21)
/** PIOC_SODR_P20 Set Output Data **/
#define PIOC_SODR_P20		(1 << 20)
/** PIOC_SODR_P19 Set Output Data **/
#define PIOC_SODR_P19		(1 << 19)
/** PIOC_SODR_P18 Set Output Data **/
#define PIOC_SODR_P18		(1 << 18)
/** PIOC_SODR_P17 Set Output Data **/
#define PIOC_SODR_P17		(1 << 17)
/** PIOC_SODR_P16 Set Output Data **/
#define PIOC_SODR_P16		(1 << 16)
/** PIOC_SODR_P15 Set Output Data **/
#define PIOC_SODR_P15		(1 << 15)
/** PIOC_SODR_P14 Set Output Data **/
#define PIOC_SODR_P14		(1 << 14)
/** PIOC_SODR_P13 Set Output Data **/
#define PIOC_SODR_P13		(1 << 13)
/** PIOC_SODR_P12 Set Output Data **/
#define PIOC_SODR_P12		(1 << 12)
/** PIOC_SODR_P11 Set Output Data **/
#define PIOC_SODR_P11		(1 << 11)
/** PIOC_SODR_P10 Set Output Data **/
#define PIOC_SODR_P10		(1 << 10)
/** PIOC_SODR_P9 Set Output Data **/
#define PIOC_SODR_P9		(1 << 9)
/** PIOC_SODR_P8 Set Output Data **/
#define PIOC_SODR_P8		(1 << 8)
/** PIOC_SODR_P7 Set Output Data **/
#define PIOC_SODR_P7		(1 << 7)
/** PIOC_SODR_P6 Set Output Data **/
#define PIOC_SODR_P6		(1 << 6)
/** PIOC_SODR_P5 Set Output Data **/
#define PIOC_SODR_P5		(1 << 5)
/** PIOC_SODR_P4 Set Output Data **/
#define PIOC_SODR_P4		(1 << 4)
/** PIOC_SODR_P3 Set Output Data **/
#define PIOC_SODR_P3		(1 << 3)
/** PIOC_SODR_P2 Set Output Data **/
#define PIOC_SODR_P2		(1 << 2)
/** PIOC_SODR_P1 Set Output Data **/
#define PIOC_SODR_P1		(1 << 1)
/** PIOC_SODR_P0 Set Output Data **/
#define PIOC_SODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_codr CODR Clear Output Data Register
@{*/

/** PIOC_CODR_P31 Clear Output Data **/
#define PIOC_CODR_P31		(1 << 31)
/** PIOC_CODR_P30 Clear Output Data **/
#define PIOC_CODR_P30		(1 << 30)
/** PIOC_CODR_P29 Clear Output Data **/
#define PIOC_CODR_P29		(1 << 29)
/** PIOC_CODR_P28 Clear Output Data **/
#define PIOC_CODR_P28		(1 << 28)
/** PIOC_CODR_P27 Clear Output Data **/
#define PIOC_CODR_P27		(1 << 27)
/** PIOC_CODR_P26 Clear Output Data **/
#define PIOC_CODR_P26		(1 << 26)
/** PIOC_CODR_P25 Clear Output Data **/
#define PIOC_CODR_P25		(1 << 25)
/** PIOC_CODR_P24 Clear Output Data **/
#define PIOC_CODR_P24		(1 << 24)
/** PIOC_CODR_P23 Clear Output Data **/
#define PIOC_CODR_P23		(1 << 23)
/** PIOC_CODR_P22 Clear Output Data **/
#define PIOC_CODR_P22		(1 << 22)
/** PIOC_CODR_P21 Clear Output Data **/
#define PIOC_CODR_P21		(1 << 21)
/** PIOC_CODR_P20 Clear Output Data **/
#define PIOC_CODR_P20		(1 << 20)
/** PIOC_CODR_P19 Clear Output Data **/
#define PIOC_CODR_P19		(1 << 19)
/** PIOC_CODR_P18 Clear Output Data **/
#define PIOC_CODR_P18		(1 << 18)
/** PIOC_CODR_P17 Clear Output Data **/
#define PIOC_CODR_P17		(1 << 17)
/** PIOC_CODR_P16 Clear Output Data **/
#define PIOC_CODR_P16		(1 << 16)
/** PIOC_CODR_P15 Clear Output Data **/
#define PIOC_CODR_P15		(1 << 15)
/** PIOC_CODR_P14 Clear Output Data **/
#define PIOC_CODR_P14		(1 << 14)
/** PIOC_CODR_P13 Clear Output Data **/
#define PIOC_CODR_P13		(1 << 13)
/** PIOC_CODR_P12 Clear Output Data **/
#define PIOC_CODR_P12		(1 << 12)
/** PIOC_CODR_P11 Clear Output Data **/
#define PIOC_CODR_P11		(1 << 11)
/** PIOC_CODR_P10 Clear Output Data **/
#define PIOC_CODR_P10		(1 << 10)
/** PIOC_CODR_P9 Clear Output Data **/
#define PIOC_CODR_P9		(1 << 9)
/** PIOC_CODR_P8 Clear Output Data **/
#define PIOC_CODR_P8		(1 << 8)
/** PIOC_CODR_P7 Clear Output Data **/
#define PIOC_CODR_P7		(1 << 7)
/** PIOC_CODR_P6 Clear Output Data **/
#define PIOC_CODR_P6		(1 << 6)
/** PIOC_CODR_P5 Clear Output Data **/
#define PIOC_CODR_P5		(1 << 5)
/** PIOC_CODR_P4 Clear Output Data **/
#define PIOC_CODR_P4		(1 << 4)
/** PIOC_CODR_P3 Clear Output Data **/
#define PIOC_CODR_P3		(1 << 3)
/** PIOC_CODR_P2 Clear Output Data **/
#define PIOC_CODR_P2		(1 << 2)
/** PIOC_CODR_P1 Clear Output Data **/
#define PIOC_CODR_P1		(1 << 1)
/** PIOC_CODR_P0 Clear Output Data **/
#define PIOC_CODR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_odsr ODSR Output Data Status Register
@{*/

/** PIOC_ODSR_P31 Output Data Status **/
#define PIOC_ODSR_P31		(1 << 31)
/** PIOC_ODSR_P30 Output Data Status **/
#define PIOC_ODSR_P30		(1 << 30)
/** PIOC_ODSR_P29 Output Data Status **/
#define PIOC_ODSR_P29		(1 << 29)
/** PIOC_ODSR_P28 Output Data Status **/
#define PIOC_ODSR_P28		(1 << 28)
/** PIOC_ODSR_P27 Output Data Status **/
#define PIOC_ODSR_P27		(1 << 27)
/** PIOC_ODSR_P26 Output Data Status **/
#define PIOC_ODSR_P26		(1 << 26)
/** PIOC_ODSR_P25 Output Data Status **/
#define PIOC_ODSR_P25		(1 << 25)
/** PIOC_ODSR_P24 Output Data Status **/
#define PIOC_ODSR_P24		(1 << 24)
/** PIOC_ODSR_P23 Output Data Status **/
#define PIOC_ODSR_P23		(1 << 23)
/** PIOC_ODSR_P22 Output Data Status **/
#define PIOC_ODSR_P22		(1 << 22)
/** PIOC_ODSR_P21 Output Data Status **/
#define PIOC_ODSR_P21		(1 << 21)
/** PIOC_ODSR_P20 Output Data Status **/
#define PIOC_ODSR_P20		(1 << 20)
/** PIOC_ODSR_P19 Output Data Status **/
#define PIOC_ODSR_P19		(1 << 19)
/** PIOC_ODSR_P18 Output Data Status **/
#define PIOC_ODSR_P18		(1 << 18)
/** PIOC_ODSR_P17 Output Data Status **/
#define PIOC_ODSR_P17		(1 << 17)
/** PIOC_ODSR_P16 Output Data Status **/
#define PIOC_ODSR_P16		(1 << 16)
/** PIOC_ODSR_P15 Output Data Status **/
#define PIOC_ODSR_P15		(1 << 15)
/** PIOC_ODSR_P14 Output Data Status **/
#define PIOC_ODSR_P14		(1 << 14)
/** PIOC_ODSR_P13 Output Data Status **/
#define PIOC_ODSR_P13		(1 << 13)
/** PIOC_ODSR_P12 Output Data Status **/
#define PIOC_ODSR_P12		(1 << 12)
/** PIOC_ODSR_P11 Output Data Status **/
#define PIOC_ODSR_P11		(1 << 11)
/** PIOC_ODSR_P10 Output Data Status **/
#define PIOC_ODSR_P10		(1 << 10)
/** PIOC_ODSR_P9 Output Data Status **/
#define PIOC_ODSR_P9		(1 << 9)
/** PIOC_ODSR_P8 Output Data Status **/
#define PIOC_ODSR_P8		(1 << 8)
/** PIOC_ODSR_P7 Output Data Status **/
#define PIOC_ODSR_P7		(1 << 7)
/** PIOC_ODSR_P6 Output Data Status **/
#define PIOC_ODSR_P6		(1 << 6)
/** PIOC_ODSR_P5 Output Data Status **/
#define PIOC_ODSR_P5		(1 << 5)
/** PIOC_ODSR_P4 Output Data Status **/
#define PIOC_ODSR_P4		(1 << 4)
/** PIOC_ODSR_P3 Output Data Status **/
#define PIOC_ODSR_P3		(1 << 3)
/** PIOC_ODSR_P2 Output Data Status **/
#define PIOC_ODSR_P2		(1 << 2)
/** PIOC_ODSR_P1 Output Data Status **/
#define PIOC_ODSR_P1		(1 << 1)
/** PIOC_ODSR_P0 Output Data Status **/
#define PIOC_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pdsr PDSR Pin Data Status Register
@{*/

/** PIOC_PDSR_P31 Output Data Status **/
#define PIOC_PDSR_P31		(1 << 31)
/** PIOC_PDSR_P30 Output Data Status **/
#define PIOC_PDSR_P30		(1 << 30)
/** PIOC_PDSR_P29 Output Data Status **/
#define PIOC_PDSR_P29		(1 << 29)
/** PIOC_PDSR_P28 Output Data Status **/
#define PIOC_PDSR_P28		(1 << 28)
/** PIOC_PDSR_P27 Output Data Status **/
#define PIOC_PDSR_P27		(1 << 27)
/** PIOC_PDSR_P26 Output Data Status **/
#define PIOC_PDSR_P26		(1 << 26)
/** PIOC_PDSR_P25 Output Data Status **/
#define PIOC_PDSR_P25		(1 << 25)
/** PIOC_PDSR_P24 Output Data Status **/
#define PIOC_PDSR_P24		(1 << 24)
/** PIOC_PDSR_P23 Output Data Status **/
#define PIOC_PDSR_P23		(1 << 23)
/** PIOC_PDSR_P22 Output Data Status **/
#define PIOC_PDSR_P22		(1 << 22)
/** PIOC_PDSR_P21 Output Data Status **/
#define PIOC_PDSR_P21		(1 << 21)
/** PIOC_PDSR_P20 Output Data Status **/
#define PIOC_PDSR_P20		(1 << 20)
/** PIOC_PDSR_P19 Output Data Status **/
#define PIOC_PDSR_P19		(1 << 19)
/** PIOC_PDSR_P18 Output Data Status **/
#define PIOC_PDSR_P18		(1 << 18)
/** PIOC_PDSR_P17 Output Data Status **/
#define PIOC_PDSR_P17		(1 << 17)
/** PIOC_PDSR_P16 Output Data Status **/
#define PIOC_PDSR_P16		(1 << 16)
/** PIOC_PDSR_P15 Output Data Status **/
#define PIOC_PDSR_P15		(1 << 15)
/** PIOC_PDSR_P14 Output Data Status **/
#define PIOC_PDSR_P14		(1 << 14)
/** PIOC_PDSR_P13 Output Data Status **/
#define PIOC_PDSR_P13		(1 << 13)
/** PIOC_PDSR_P12 Output Data Status **/
#define PIOC_PDSR_P12		(1 << 12)
/** PIOC_PDSR_P11 Output Data Status **/
#define PIOC_PDSR_P11		(1 << 11)
/** PIOC_PDSR_P10 Output Data Status **/
#define PIOC_PDSR_P10		(1 << 10)
/** PIOC_PDSR_P9 Output Data Status **/
#define PIOC_PDSR_P9		(1 << 9)
/** PIOC_PDSR_P8 Output Data Status **/
#define PIOC_PDSR_P8		(1 << 8)
/** PIOC_PDSR_P7 Output Data Status **/
#define PIOC_PDSR_P7		(1 << 7)
/** PIOC_PDSR_P6 Output Data Status **/
#define PIOC_PDSR_P6		(1 << 6)
/** PIOC_PDSR_P5 Output Data Status **/
#define PIOC_PDSR_P5		(1 << 5)
/** PIOC_PDSR_P4 Output Data Status **/
#define PIOC_PDSR_P4		(1 << 4)
/** PIOC_PDSR_P3 Output Data Status **/
#define PIOC_PDSR_P3		(1 << 3)
/** PIOC_PDSR_P2 Output Data Status **/
#define PIOC_PDSR_P2		(1 << 2)
/** PIOC_PDSR_P1 Output Data Status **/
#define PIOC_PDSR_P1		(1 << 1)
/** PIOC_PDSR_P0 Output Data Status **/
#define PIOC_PDSR_P0		(1 << 0)

/**@}*/

