grevaillot/svd_tools/headers/ATSAM4SP32A/pioc.h
/** @defgroup pioc_ier IER Interrupt Enable Register
@{*/

/** PIOC_IER_P31 Input Change Interrupt Enable **/
#define PIOC_IER_P31		(1 << 31)
/** PIOC_IER_P30 Input Change Interrupt Enable **/
#define PIOC_IER_P30		(1 << 30)
/** PIOC_IER_P29 Input Change Interrupt Enable **/
#define PIOC_IER_P29		(1 << 29)
/** PIOC_IER_P28 Input Change Interrupt Enable **/
#define PIOC_IER_P28		(1 << 28)
/** PIOC_IER_P27 Input Change Interrupt Enable **/
#define PIOC_IER_P27		(1 << 27)
/** PIOC_IER_P26 Input Change Interrupt Enable **/
#define PIOC_IER_P26		(1 << 26)
/** PIOC_IER_P25 Input Change Interrupt Enable **/
#define PIOC_IER_P25		(1 << 25)
/** PIOC_IER_P24 Input Change Interrupt Enable **/
#define PIOC_IER_P24		(1 << 24)
/** PIOC_IER_P23 Input Change Interrupt Enable **/
#define PIOC_IER_P23		(1 << 23)
/** PIOC_IER_P22 Input Change Interrupt Enable **/
#define PIOC_IER_P22		(1 << 22)
/** PIOC_IER_P21 Input Change Interrupt Enable **/
#define PIOC_IER_P21		(1 << 21)
/** PIOC_IER_P20 Input Change Interrupt Enable **/
#define PIOC_IER_P20		(1 << 20)
/** PIOC_IER_P19 Input Change Interrupt Enable **/
#define PIOC_IER_P19		(1 << 19)
/** PIOC_IER_P18 Input Change Interrupt Enable **/
#define PIOC_IER_P18		(1 << 18)
/** PIOC_IER_P17 Input Change Interrupt Enable **/
#define PIOC_IER_P17		(1 << 17)
/** PIOC_IER_P16 Input Change Interrupt Enable **/
#define PIOC_IER_P16		(1 << 16)
/** PIOC_IER_P15 Input Change Interrupt Enable **/
#define PIOC_IER_P15		(1 << 15)
/** PIOC_IER_P14 Input Change Interrupt Enable **/
#define PIOC_IER_P14		(1 << 14)
/** PIOC_IER_P13 Input Change Interrupt Enable **/
#define PIOC_IER_P13		(1 << 13)
/** PIOC_IER_P12 Input Change Interrupt Enable **/
#define PIOC_IER_P12		(1 << 12)
/** PIOC_IER_P11 Input Change Interrupt Enable **/
#define PIOC_IER_P11		(1 << 11)
/** PIOC_IER_P10 Input Change Interrupt Enable **/
#define PIOC_IER_P10		(1 << 10)
/** PIOC_IER_P9 Input Change Interrupt Enable **/
#define PIOC_IER_P9		(1 << 9)
/** PIOC_IER_P8 Input Change Interrupt Enable **/
#define PIOC_IER_P8		(1 << 8)
/** PIOC_IER_P7 Input Change Interrupt Enable **/
#define PIOC_IER_P7		(1 << 7)
/** PIOC_IER_P6 Input Change Interrupt Enable **/
#define PIOC_IER_P6		(1 << 6)
/** PIOC_IER_P5 Input Change Interrupt Enable **/
#define PIOC_IER_P5		(1 << 5)
/** PIOC_IER_P4 Input Change Interrupt Enable **/
#define PIOC_IER_P4		(1 << 4)
/** PIOC_IER_P3 Input Change Interrupt Enable **/
#define PIOC_IER_P3		(1 << 3)
/** PIOC_IER_P2 Input Change Interrupt Enable **/
#define PIOC_IER_P2		(1 << 2)
/** PIOC_IER_P1 Input Change Interrupt Enable **/
#define PIOC_IER_P1		(1 << 1)
/** PIOC_IER_P0 Input Change Interrupt Enable **/
#define PIOC_IER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_idr IDR Interrupt Disable Register
@{*/

/** PIOC_IDR_P31 Input Change Interrupt Disable **/
#define PIOC_IDR_P31		(1 << 31)
/** PIOC_IDR_P30 Input Change Interrupt Disable **/
#define PIOC_IDR_P30		(1 << 30)
/** PIOC_IDR_P29 Input Change Interrupt Disable **/
#define PIOC_IDR_P29		(1 << 29)
/** PIOC_IDR_P28 Input Change Interrupt Disable **/
#define PIOC_IDR_P28		(1 << 28)
/** PIOC_IDR_P27 Input Change Interrupt Disable **/
#define PIOC_IDR_P27		(1 << 27)
/** PIOC_IDR_P26 Input Change Interrupt Disable **/
#define PIOC_IDR_P26		(1 << 26)
/** PIOC_IDR_P25 Input Change Interrupt Disable **/
#define PIOC_IDR_P25		(1 << 25)
/** PIOC_IDR_P24 Input Change Interrupt Disable **/
#define PIOC_IDR_P24		(1 << 24)
/** PIOC_IDR_P23 Input Change Interrupt Disable **/
#define PIOC_IDR_P23		(1 << 23)
/** PIOC_IDR_P22 Input Change Interrupt Disable **/
#define PIOC_IDR_P22		(1 << 22)
/** PIOC_IDR_P21 Input Change Interrupt Disable **/
#define PIOC_IDR_P21		(1 << 21)
/** PIOC_IDR_P20 Input Change Interrupt Disable **/
#define PIOC_IDR_P20		(1 << 20)
/** PIOC_IDR_P19 Input Change Interrupt Disable **/
#define PIOC_IDR_P19		(1 << 19)
/** PIOC_IDR_P18 Input Change Interrupt Disable **/
#define PIOC_IDR_P18		(1 << 18)
/** PIOC_IDR_P17 Input Change Interrupt Disable **/
#define PIOC_IDR_P17		(1 << 17)
/** PIOC_IDR_P16 Input Change Interrupt Disable **/
#define PIOC_IDR_P16		(1 << 16)
/** PIOC_IDR_P15 Input Change Interrupt Disable **/
#define PIOC_IDR_P15		(1 << 15)
/** PIOC_IDR_P14 Input Change Interrupt Disable **/
#define PIOC_IDR_P14		(1 << 14)
/** PIOC_IDR_P13 Input Change Interrupt Disable **/
#define PIOC_IDR_P13		(1 << 13)
/** PIOC_IDR_P12 Input Change Interrupt Disable **/
#define PIOC_IDR_P12		(1 << 12)
/** PIOC_IDR_P11 Input Change Interrupt Disable **/
#define PIOC_IDR_P11		(1 << 11)
/** PIOC_IDR_P10 Input Change Interrupt Disable **/
#define PIOC_IDR_P10		(1 << 10)
/** PIOC_IDR_P9 Input Change Interrupt Disable **/
#define PIOC_IDR_P9		(1 << 9)
/** PIOC_IDR_P8 Input Change Interrupt Disable **/
#define PIOC_IDR_P8		(1 << 8)
/** PIOC_IDR_P7 Input Change Interrupt Disable **/
#define PIOC_IDR_P7		(1 << 7)
/** PIOC_IDR_P6 Input Change Interrupt Disable **/
#define PIOC_IDR_P6		(1 << 6)
/** PIOC_IDR_P5 Input Change Interrupt Disable **/
#define PIOC_IDR_P5		(1 << 5)
/** PIOC_IDR_P4 Input Change Interrupt Disable **/
#define PIOC_IDR_P4		(1 << 4)
/** PIOC_IDR_P3 Input Change Interrupt Disable **/
#define PIOC_IDR_P3		(1 << 3)
/** PIOC_IDR_P2 Input Change Interrupt Disable **/
#define PIOC_IDR_P2		(1 << 2)
/** PIOC_IDR_P1 Input Change Interrupt Disable **/
#define PIOC_IDR_P1		(1 << 1)
/** PIOC_IDR_P0 Input Change Interrupt Disable **/
#define PIOC_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_imr IMR Interrupt Mask Register
@{*/

/** PIOC_IMR_P31 Input Change Interrupt Mask **/
#define PIOC_IMR_P31		(1 << 31)
/** PIOC_IMR_P30 Input Change Interrupt Mask **/
#define PIOC_IMR_P30		(1 << 30)
/** PIOC_IMR_P29 Input Change Interrupt Mask **/
#define PIOC_IMR_P29		(1 << 29)
/** PIOC_IMR_P28 Input Change Interrupt Mask **/
#define PIOC_IMR_P28		(1 << 28)
/** PIOC_IMR_P27 Input Change Interrupt Mask **/
#define PIOC_IMR_P27		(1 << 27)
/** PIOC_IMR_P26 Input Change Interrupt Mask **/
#define PIOC_IMR_P26		(1 << 26)
/** PIOC_IMR_P25 Input Change Interrupt Mask **/
#define PIOC_IMR_P25		(1 << 25)
/** PIOC_IMR_P24 Input Change Interrupt Mask **/
#define PIOC_IMR_P24		(1 << 24)
/** PIOC_IMR_P23 Input Change Interrupt Mask **/
#define PIOC_IMR_P23		(1 << 23)
/** PIOC_IMR_P22 Input Change Interrupt Mask **/
#define PIOC_IMR_P22		(1 << 22)
/** PIOC_IMR_P21 Input Change Interrupt Mask **/
#define PIOC_IMR_P21		(1 << 21)
/** PIOC_IMR_P20 Input Change Interrupt Mask **/
#define PIOC_IMR_P20		(1 << 20)
/** PIOC_IMR_P19 Input Change Interrupt Mask **/
#define PIOC_IMR_P19		(1 << 19)
/** PIOC_IMR_P18 Input Change Interrupt Mask **/
#define PIOC_IMR_P18		(1 << 18)
/** PIOC_IMR_P17 Input Change Interrupt Mask **/
#define PIOC_IMR_P17		(1 << 17)
/** PIOC_IMR_P16 Input Change Interrupt Mask **/
#define PIOC_IMR_P16		(1 << 16)
/** PIOC_IMR_P15 Input Change Interrupt Mask **/
#define PIOC_IMR_P15		(1 << 15)
/** PIOC_IMR_P14 Input Change Interrupt Mask **/
#define PIOC_IMR_P14		(1 << 14)
/** PIOC_IMR_P13 Input Change Interrupt Mask **/
#define PIOC_IMR_P13		(1 << 13)
/** PIOC_IMR_P12 Input Change Interrupt Mask **/
#define PIOC_IMR_P12		(1 << 12)
/** PIOC_IMR_P11 Input Change Interrupt Mask **/
#define PIOC_IMR_P11		(1 << 11)
/** PIOC_IMR_P10 Input Change Interrupt Mask **/
#define PIOC_IMR_P10		(1 << 10)
/** PIOC_IMR_P9 Input Change Interrupt Mask **/
#define PIOC_IMR_P9		(1 << 9)
/** PIOC_IMR_P8 Input Change Interrupt Mask **/
#define PIOC_IMR_P8		(1 << 8)
/** PIOC_IMR_P7 Input Change Interrupt Mask **/
#define PIOC_IMR_P7		(1 << 7)
/** PIOC_IMR_P6 Input Change Interrupt Mask **/
#define PIOC_IMR_P6		(1 << 6)
/** PIOC_IMR_P5 Input Change Interrupt Mask **/
#define PIOC_IMR_P5		(1 << 5)
/** PIOC_IMR_P4 Input Change Interrupt Mask **/
#define PIOC_IMR_P4		(1 << 4)
/** PIOC_IMR_P3 Input Change Interrupt Mask **/
#define PIOC_IMR_P3		(1 << 3)
/** PIOC_IMR_P2 Input Change Interrupt Mask **/
#define PIOC_IMR_P2		(1 << 2)
/** PIOC_IMR_P1 Input Change Interrupt Mask **/
#define PIOC_IMR_P1		(1 << 1)
/** PIOC_IMR_P0 Input Change Interrupt Mask **/
#define PIOC_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_isr ISR Interrupt Status Register
@{*/

/** PIOC_ISR_P31 Input Change Interrupt Status **/
#define PIOC_ISR_P31		(1 << 31)
/** PIOC_ISR_P30 Input Change Interrupt Status **/
#define PIOC_ISR_P30		(1 << 30)
/** PIOC_ISR_P29 Input Change Interrupt Status **/
#define PIOC_ISR_P29		(1 << 29)
/** PIOC_ISR_P28 Input Change Interrupt Status **/
#define PIOC_ISR_P28		(1 << 28)
/** PIOC_ISR_P27 Input Change Interrupt Status **/
#define PIOC_ISR_P27		(1 << 27)
/** PIOC_ISR_P26 Input Change Interrupt Status **/
#define PIOC_ISR_P26		(1 << 26)
/** PIOC_ISR_P25 Input Change Interrupt Status **/
#define PIOC_ISR_P25		(1 << 25)
/** PIOC_ISR_P24 Input Change Interrupt Status **/
#define PIOC_ISR_P24		(1 << 24)
/** PIOC_ISR_P23 Input Change Interrupt Status **/
#define PIOC_ISR_P23		(1 << 23)
/** PIOC_ISR_P22 Input Change Interrupt Status **/
#define PIOC_ISR_P22		(1 << 22)
/** PIOC_ISR_P21 Input Change Interrupt Status **/
#define PIOC_ISR_P21		(1 << 21)
/** PIOC_ISR_P20 Input Change Interrupt Status **/
#define PIOC_ISR_P20		(1 << 20)
/** PIOC_ISR_P19 Input Change Interrupt Status **/
#define PIOC_ISR_P19		(1 << 19)
/** PIOC_ISR_P18 Input Change Interrupt Status **/
#define PIOC_ISR_P18		(1 << 18)
/** PIOC_ISR_P17 Input Change Interrupt Status **/
#define PIOC_ISR_P17		(1 << 17)
/** PIOC_ISR_P16 Input Change Interrupt Status **/
#define PIOC_ISR_P16		(1 << 16)
/** PIOC_ISR_P15 Input Change Interrupt Status **/
#define PIOC_ISR_P15		(1 << 15)
/** PIOC_ISR_P14 Input Change Interrupt Status **/
#define PIOC_ISR_P14		(1 << 14)
/** PIOC_ISR_P13 Input Change Interrupt Status **/
#define PIOC_ISR_P13		(1 << 13)
/** PIOC_ISR_P12 Input Change Interrupt Status **/
#define PIOC_ISR_P12		(1 << 12)
/** PIOC_ISR_P11 Input Change Interrupt Status **/
#define PIOC_ISR_P11		(1 << 11)
/** PIOC_ISR_P10 Input Change Interrupt Status **/
#define PIOC_ISR_P10		(1 << 10)
/** PIOC_ISR_P9 Input Change Interrupt Status **/
#define PIOC_ISR_P9		(1 << 9)
/** PIOC_ISR_P8 Input Change Interrupt Status **/
#define PIOC_ISR_P8		(1 << 8)
/** PIOC_ISR_P7 Input Change Interrupt Status **/
#define PIOC_ISR_P7		(1 << 7)
/** PIOC_ISR_P6 Input Change Interrupt Status **/
#define PIOC_ISR_P6		(1 << 6)
/** PIOC_ISR_P5 Input Change Interrupt Status **/
#define PIOC_ISR_P5		(1 << 5)
/** PIOC_ISR_P4 Input Change Interrupt Status **/
#define PIOC_ISR_P4		(1 << 4)
/** PIOC_ISR_P3 Input Change Interrupt Status **/
#define PIOC_ISR_P3		(1 << 3)
/** PIOC_ISR_P2 Input Change Interrupt Status **/
#define PIOC_ISR_P2		(1 << 2)
/** PIOC_ISR_P1 Input Change Interrupt Status **/
#define PIOC_ISR_P1		(1 << 1)
/** PIOC_ISR_P0 Input Change Interrupt Status **/
#define PIOC_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_mder MDER Multi-driver Enable Register
@{*/

