grevaillot/svd_tools/headers/ATSAM4SP32A/pioc.h
/** @defgroup pioc_abcdsr[1] ABCDSR[1] Peripheral Select Register
@{*/

/** PIOC_ABCDSR[1]_P31 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P31		(1 << 31)
/** PIOC_ABCDSR[1]_P30 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P30		(1 << 30)
/** PIOC_ABCDSR[1]_P29 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P29		(1 << 29)
/** PIOC_ABCDSR[1]_P28 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P28		(1 << 28)
/** PIOC_ABCDSR[1]_P27 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P27		(1 << 27)
/** PIOC_ABCDSR[1]_P26 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P26		(1 << 26)
/** PIOC_ABCDSR[1]_P25 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P25		(1 << 25)
/** PIOC_ABCDSR[1]_P24 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P24		(1 << 24)
/** PIOC_ABCDSR[1]_P23 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P23		(1 << 23)
/** PIOC_ABCDSR[1]_P22 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P22		(1 << 22)
/** PIOC_ABCDSR[1]_P21 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P21		(1 << 21)
/** PIOC_ABCDSR[1]_P20 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P20		(1 << 20)
/** PIOC_ABCDSR[1]_P19 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P19		(1 << 19)
/** PIOC_ABCDSR[1]_P18 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P18		(1 << 18)
/** PIOC_ABCDSR[1]_P17 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P17		(1 << 17)
/** PIOC_ABCDSR[1]_P16 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P16		(1 << 16)
/** PIOC_ABCDSR[1]_P15 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P15		(1 << 15)
/** PIOC_ABCDSR[1]_P14 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P14		(1 << 14)
/** PIOC_ABCDSR[1]_P13 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P13		(1 << 13)
/** PIOC_ABCDSR[1]_P12 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P12		(1 << 12)
/** PIOC_ABCDSR[1]_P11 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P11		(1 << 11)
/** PIOC_ABCDSR[1]_P10 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P10		(1 << 10)
/** PIOC_ABCDSR[1]_P9 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P9		(1 << 9)
/** PIOC_ABCDSR[1]_P8 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P8		(1 << 8)
/** PIOC_ABCDSR[1]_P7 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P7		(1 << 7)
/** PIOC_ABCDSR[1]_P6 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P6		(1 << 6)
/** PIOC_ABCDSR[1]_P5 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P5		(1 << 5)
/** PIOC_ABCDSR[1]_P4 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P4		(1 << 4)
/** PIOC_ABCDSR[1]_P3 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P3		(1 << 3)
/** PIOC_ABCDSR[1]_P2 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P2		(1 << 2)
/** PIOC_ABCDSR[1]_P1 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P1		(1 << 1)
/** PIOC_ABCDSR[1]_P0 Peripheral Select. **/
#define PIOC_ABCDSR[1]_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifscdr IFSCDR Input Filter Slow Clock Disable Register
@{*/

/** PIOC_IFSCDR_P31 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P31		(1 << 31)
/** PIOC_IFSCDR_P30 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P30		(1 << 30)
/** PIOC_IFSCDR_P29 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P29		(1 << 29)
/** PIOC_IFSCDR_P28 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P28		(1 << 28)
/** PIOC_IFSCDR_P27 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P27		(1 << 27)
/** PIOC_IFSCDR_P26 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P26		(1 << 26)
/** PIOC_IFSCDR_P25 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P25		(1 << 25)
/** PIOC_IFSCDR_P24 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P24		(1 << 24)
/** PIOC_IFSCDR_P23 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P23		(1 << 23)
/** PIOC_IFSCDR_P22 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P22		(1 << 22)
/** PIOC_IFSCDR_P21 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P21		(1 << 21)
/** PIOC_IFSCDR_P20 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P20		(1 << 20)
/** PIOC_IFSCDR_P19 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P19		(1 << 19)
/** PIOC_IFSCDR_P18 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P18		(1 << 18)
/** PIOC_IFSCDR_P17 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P17		(1 << 17)
/** PIOC_IFSCDR_P16 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P16		(1 << 16)
/** PIOC_IFSCDR_P15 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P15		(1 << 15)
/** PIOC_IFSCDR_P14 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P14		(1 << 14)
/** PIOC_IFSCDR_P13 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P13		(1 << 13)
/** PIOC_IFSCDR_P12 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P12		(1 << 12)
/** PIOC_IFSCDR_P11 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P11		(1 << 11)
/** PIOC_IFSCDR_P10 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P10		(1 << 10)
/** PIOC_IFSCDR_P9 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P9		(1 << 9)
/** PIOC_IFSCDR_P8 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P8		(1 << 8)
/** PIOC_IFSCDR_P7 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P7		(1 << 7)
/** PIOC_IFSCDR_P6 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P6		(1 << 6)
/** PIOC_IFSCDR_P5 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P5		(1 << 5)
/** PIOC_IFSCDR_P4 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P4		(1 << 4)
/** PIOC_IFSCDR_P3 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P3		(1 << 3)
/** PIOC_IFSCDR_P2 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P2		(1 << 2)
/** PIOC_IFSCDR_P1 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P1		(1 << 1)
/** PIOC_IFSCDR_P0 PIO Clock Glitch Filtering Select. **/
#define PIOC_IFSCDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifscer IFSCER Input Filter Slow Clock Enable Register
@{*/

/** PIOC_IFSCER_P31 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P31		(1 << 31)
/** PIOC_IFSCER_P30 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P30		(1 << 30)
/** PIOC_IFSCER_P29 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P29		(1 << 29)
/** PIOC_IFSCER_P28 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P28		(1 << 28)
/** PIOC_IFSCER_P27 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P27		(1 << 27)
/** PIOC_IFSCER_P26 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P26		(1 << 26)
/** PIOC_IFSCER_P25 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P25		(1 << 25)
/** PIOC_IFSCER_P24 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P24		(1 << 24)
/** PIOC_IFSCER_P23 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P23		(1 << 23)
/** PIOC_IFSCER_P22 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P22		(1 << 22)
/** PIOC_IFSCER_P21 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P21		(1 << 21)
/** PIOC_IFSCER_P20 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P20		(1 << 20)
/** PIOC_IFSCER_P19 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P19		(1 << 19)
/** PIOC_IFSCER_P18 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P18		(1 << 18)
/** PIOC_IFSCER_P17 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P17		(1 << 17)
/** PIOC_IFSCER_P16 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P16		(1 << 16)
/** PIOC_IFSCER_P15 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P15		(1 << 15)
/** PIOC_IFSCER_P14 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P14		(1 << 14)
/** PIOC_IFSCER_P13 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P13		(1 << 13)
/** PIOC_IFSCER_P12 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P12		(1 << 12)
/** PIOC_IFSCER_P11 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P11		(1 << 11)
/** PIOC_IFSCER_P10 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P10		(1 << 10)
/** PIOC_IFSCER_P9 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P9		(1 << 9)
/** PIOC_IFSCER_P8 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P8		(1 << 8)
/** PIOC_IFSCER_P7 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P7		(1 << 7)
/** PIOC_IFSCER_P6 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P6		(1 << 6)
/** PIOC_IFSCER_P5 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P5		(1 << 5)
/** PIOC_IFSCER_P4 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P4		(1 << 4)
/** PIOC_IFSCER_P3 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P3		(1 << 3)
/** PIOC_IFSCER_P2 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P2		(1 << 2)
/** PIOC_IFSCER_P1 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P1		(1 << 1)
/** PIOC_IFSCER_P0 Debouncing Filtering Select. **/
#define PIOC_IFSCER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ifscsr IFSCSR Input Filter Slow Clock Status Register
@{*/

/** PIOC_IFSCSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P31		(1 << 31)
/** PIOC_IFSCSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P30		(1 << 30)
/** PIOC_IFSCSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P29		(1 << 29)
/** PIOC_IFSCSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P28		(1 << 28)
/** PIOC_IFSCSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P27		(1 << 27)
/** PIOC_IFSCSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P26		(1 << 26)
/** PIOC_IFSCSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P25		(1 << 25)
/** PIOC_IFSCSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P24		(1 << 24)
/** PIOC_IFSCSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P23		(1 << 23)
/** PIOC_IFSCSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P22		(1 << 22)
/** PIOC_IFSCSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P21		(1 << 21)
/** PIOC_IFSCSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P20		(1 << 20)
/** PIOC_IFSCSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P19		(1 << 19)
/** PIOC_IFSCSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P18		(1 << 18)
/** PIOC_IFSCSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P17		(1 << 17)
/** PIOC_IFSCSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P16		(1 << 16)
/** PIOC_IFSCSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P15		(1 << 15)
/** PIOC_IFSCSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P14		(1 << 14)
/** PIOC_IFSCSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P13		(1 << 13)
/** PIOC_IFSCSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P12		(1 << 12)
/** PIOC_IFSCSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P11		(1 << 11)
/** PIOC_IFSCSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P10		(1 << 10)
/** PIOC_IFSCSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P9		(1 << 9)
/** PIOC_IFSCSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P8		(1 << 8)
/** PIOC_IFSCSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P7		(1 << 7)
/** PIOC_IFSCSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P6		(1 << 6)
/** PIOC_IFSCSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P5		(1 << 5)
/** PIOC_IFSCSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P4		(1 << 4)
/** PIOC_IFSCSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P3		(1 << 3)
/** PIOC_IFSCSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P2		(1 << 2)
/** PIOC_IFSCSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P1		(1 << 1)
/** PIOC_IFSCSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOC_IFSCSR_P0		(1 << 0)

/**@}*/

