grevaillot/svd_tools/headers/ATSAM4SP32A/pioc.h
/** @defgroup pioc_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOC_SCDR_DIV_SHIFT		0
#define PIOC_SCDR_DIV_MASK		0x3fff
/** @defgroup pioc_scdr_div DIV 
@{*/
/**@}*/


/**@}*/

/** @defgroup pioc_ppddr PPDDR Pad Pull-down Disable Register
@{*/

/** PIOC_PPDDR_P31 Pull Down Disable. **/
#define PIOC_PPDDR_P31		(1 << 31)
/** PIOC_PPDDR_P30 Pull Down Disable. **/
#define PIOC_PPDDR_P30		(1 << 30)
/** PIOC_PPDDR_P29 Pull Down Disable. **/
#define PIOC_PPDDR_P29		(1 << 29)
/** PIOC_PPDDR_P28 Pull Down Disable. **/
#define PIOC_PPDDR_P28		(1 << 28)
/** PIOC_PPDDR_P27 Pull Down Disable. **/
#define PIOC_PPDDR_P27		(1 << 27)
/** PIOC_PPDDR_P26 Pull Down Disable. **/
#define PIOC_PPDDR_P26		(1 << 26)
/** PIOC_PPDDR_P25 Pull Down Disable. **/
#define PIOC_PPDDR_P25		(1 << 25)
/** PIOC_PPDDR_P24 Pull Down Disable. **/
#define PIOC_PPDDR_P24		(1 << 24)
/** PIOC_PPDDR_P23 Pull Down Disable. **/
#define PIOC_PPDDR_P23		(1 << 23)
/** PIOC_PPDDR_P22 Pull Down Disable. **/
#define PIOC_PPDDR_P22		(1 << 22)
/** PIOC_PPDDR_P21 Pull Down Disable. **/
#define PIOC_PPDDR_P21		(1 << 21)
/** PIOC_PPDDR_P20 Pull Down Disable. **/
#define PIOC_PPDDR_P20		(1 << 20)
/** PIOC_PPDDR_P19 Pull Down Disable. **/
#define PIOC_PPDDR_P19		(1 << 19)
/** PIOC_PPDDR_P18 Pull Down Disable. **/
#define PIOC_PPDDR_P18		(1 << 18)
/** PIOC_PPDDR_P17 Pull Down Disable. **/
#define PIOC_PPDDR_P17		(1 << 17)
/** PIOC_PPDDR_P16 Pull Down Disable. **/
#define PIOC_PPDDR_P16		(1 << 16)
/** PIOC_PPDDR_P15 Pull Down Disable. **/
#define PIOC_PPDDR_P15		(1 << 15)
/** PIOC_PPDDR_P14 Pull Down Disable. **/
#define PIOC_PPDDR_P14		(1 << 14)
/** PIOC_PPDDR_P13 Pull Down Disable. **/
#define PIOC_PPDDR_P13		(1 << 13)
/** PIOC_PPDDR_P12 Pull Down Disable. **/
#define PIOC_PPDDR_P12		(1 << 12)
/** PIOC_PPDDR_P11 Pull Down Disable. **/
#define PIOC_PPDDR_P11		(1 << 11)
/** PIOC_PPDDR_P10 Pull Down Disable. **/
#define PIOC_PPDDR_P10		(1 << 10)
/** PIOC_PPDDR_P9 Pull Down Disable. **/
#define PIOC_PPDDR_P9		(1 << 9)
/** PIOC_PPDDR_P8 Pull Down Disable. **/
#define PIOC_PPDDR_P8		(1 << 8)
/** PIOC_PPDDR_P7 Pull Down Disable. **/
#define PIOC_PPDDR_P7		(1 << 7)
/** PIOC_PPDDR_P6 Pull Down Disable. **/
#define PIOC_PPDDR_P6		(1 << 6)
/** PIOC_PPDDR_P5 Pull Down Disable. **/
#define PIOC_PPDDR_P5		(1 << 5)
/** PIOC_PPDDR_P4 Pull Down Disable. **/
#define PIOC_PPDDR_P4		(1 << 4)
/** PIOC_PPDDR_P3 Pull Down Disable. **/
#define PIOC_PPDDR_P3		(1 << 3)
/** PIOC_PPDDR_P2 Pull Down Disable. **/
#define PIOC_PPDDR_P2		(1 << 2)
/** PIOC_PPDDR_P1 Pull Down Disable. **/
#define PIOC_PPDDR_P1		(1 << 1)
/** PIOC_PPDDR_P0 Pull Down Disable. **/
#define PIOC_PPDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ppder PPDER Pad Pull-down Enable Register
@{*/

/** PIOC_PPDER_P31 Pull Down Enable. **/
#define PIOC_PPDER_P31		(1 << 31)
/** PIOC_PPDER_P30 Pull Down Enable. **/
#define PIOC_PPDER_P30		(1 << 30)
/** PIOC_PPDER_P29 Pull Down Enable. **/
#define PIOC_PPDER_P29		(1 << 29)
/** PIOC_PPDER_P28 Pull Down Enable. **/
#define PIOC_PPDER_P28		(1 << 28)
/** PIOC_PPDER_P27 Pull Down Enable. **/
#define PIOC_PPDER_P27		(1 << 27)
/** PIOC_PPDER_P26 Pull Down Enable. **/
#define PIOC_PPDER_P26		(1 << 26)
/** PIOC_PPDER_P25 Pull Down Enable. **/
#define PIOC_PPDER_P25		(1 << 25)
/** PIOC_PPDER_P24 Pull Down Enable. **/
#define PIOC_PPDER_P24		(1 << 24)
/** PIOC_PPDER_P23 Pull Down Enable. **/
#define PIOC_PPDER_P23		(1 << 23)
/** PIOC_PPDER_P22 Pull Down Enable. **/
#define PIOC_PPDER_P22		(1 << 22)
/** PIOC_PPDER_P21 Pull Down Enable. **/
#define PIOC_PPDER_P21		(1 << 21)
/** PIOC_PPDER_P20 Pull Down Enable. **/
#define PIOC_PPDER_P20		(1 << 20)
/** PIOC_PPDER_P19 Pull Down Enable. **/
#define PIOC_PPDER_P19		(1 << 19)
/** PIOC_PPDER_P18 Pull Down Enable. **/
#define PIOC_PPDER_P18		(1 << 18)
/** PIOC_PPDER_P17 Pull Down Enable. **/
#define PIOC_PPDER_P17		(1 << 17)
/** PIOC_PPDER_P16 Pull Down Enable. **/
#define PIOC_PPDER_P16		(1 << 16)
/** PIOC_PPDER_P15 Pull Down Enable. **/
#define PIOC_PPDER_P15		(1 << 15)
/** PIOC_PPDER_P14 Pull Down Enable. **/
#define PIOC_PPDER_P14		(1 << 14)
/** PIOC_PPDER_P13 Pull Down Enable. **/
#define PIOC_PPDER_P13		(1 << 13)
/** PIOC_PPDER_P12 Pull Down Enable. **/
#define PIOC_PPDER_P12		(1 << 12)
/** PIOC_PPDER_P11 Pull Down Enable. **/
#define PIOC_PPDER_P11		(1 << 11)
/** PIOC_PPDER_P10 Pull Down Enable. **/
#define PIOC_PPDER_P10		(1 << 10)
/** PIOC_PPDER_P9 Pull Down Enable. **/
#define PIOC_PPDER_P9		(1 << 9)
/** PIOC_PPDER_P8 Pull Down Enable. **/
#define PIOC_PPDER_P8		(1 << 8)
/** PIOC_PPDER_P7 Pull Down Enable. **/
#define PIOC_PPDER_P7		(1 << 7)
/** PIOC_PPDER_P6 Pull Down Enable. **/
#define PIOC_PPDER_P6		(1 << 6)
/** PIOC_PPDER_P5 Pull Down Enable. **/
#define PIOC_PPDER_P5		(1 << 5)
/** PIOC_PPDER_P4 Pull Down Enable. **/
#define PIOC_PPDER_P4		(1 << 4)
/** PIOC_PPDER_P3 Pull Down Enable. **/
#define PIOC_PPDER_P3		(1 << 3)
/** PIOC_PPDER_P2 Pull Down Enable. **/
#define PIOC_PPDER_P2		(1 << 2)
/** PIOC_PPDER_P1 Pull Down Enable. **/
#define PIOC_PPDER_P1		(1 << 1)
/** PIOC_PPDER_P0 Pull Down Enable. **/
#define PIOC_PPDER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ppdsr PPDSR Pad Pull-down Status Register
@{*/

/** PIOC_PPDSR_P31 Pull Down Status. **/
#define PIOC_PPDSR_P31		(1 << 31)
/** PIOC_PPDSR_P30 Pull Down Status. **/
#define PIOC_PPDSR_P30		(1 << 30)
/** PIOC_PPDSR_P29 Pull Down Status. **/
#define PIOC_PPDSR_P29		(1 << 29)
/** PIOC_PPDSR_P28 Pull Down Status. **/
#define PIOC_PPDSR_P28		(1 << 28)
/** PIOC_PPDSR_P27 Pull Down Status. **/
#define PIOC_PPDSR_P27		(1 << 27)
/** PIOC_PPDSR_P26 Pull Down Status. **/
#define PIOC_PPDSR_P26		(1 << 26)
/** PIOC_PPDSR_P25 Pull Down Status. **/
#define PIOC_PPDSR_P25		(1 << 25)
/** PIOC_PPDSR_P24 Pull Down Status. **/
#define PIOC_PPDSR_P24		(1 << 24)
/** PIOC_PPDSR_P23 Pull Down Status. **/
#define PIOC_PPDSR_P23		(1 << 23)
/** PIOC_PPDSR_P22 Pull Down Status. **/
#define PIOC_PPDSR_P22		(1 << 22)
/** PIOC_PPDSR_P21 Pull Down Status. **/
#define PIOC_PPDSR_P21		(1 << 21)
/** PIOC_PPDSR_P20 Pull Down Status. **/
#define PIOC_PPDSR_P20		(1 << 20)
/** PIOC_PPDSR_P19 Pull Down Status. **/
#define PIOC_PPDSR_P19		(1 << 19)
/** PIOC_PPDSR_P18 Pull Down Status. **/
#define PIOC_PPDSR_P18		(1 << 18)
/** PIOC_PPDSR_P17 Pull Down Status. **/
#define PIOC_PPDSR_P17		(1 << 17)
/** PIOC_PPDSR_P16 Pull Down Status. **/
#define PIOC_PPDSR_P16		(1 << 16)
/** PIOC_PPDSR_P15 Pull Down Status. **/
#define PIOC_PPDSR_P15		(1 << 15)
/** PIOC_PPDSR_P14 Pull Down Status. **/
#define PIOC_PPDSR_P14		(1 << 14)
/** PIOC_PPDSR_P13 Pull Down Status. **/
#define PIOC_PPDSR_P13		(1 << 13)
/** PIOC_PPDSR_P12 Pull Down Status. **/
#define PIOC_PPDSR_P12		(1 << 12)
/** PIOC_PPDSR_P11 Pull Down Status. **/
#define PIOC_PPDSR_P11		(1 << 11)
/** PIOC_PPDSR_P10 Pull Down Status. **/
#define PIOC_PPDSR_P10		(1 << 10)
/** PIOC_PPDSR_P9 Pull Down Status. **/
#define PIOC_PPDSR_P9		(1 << 9)
/** PIOC_PPDSR_P8 Pull Down Status. **/
#define PIOC_PPDSR_P8		(1 << 8)
/** PIOC_PPDSR_P7 Pull Down Status. **/
#define PIOC_PPDSR_P7		(1 << 7)
/** PIOC_PPDSR_P6 Pull Down Status. **/
#define PIOC_PPDSR_P6		(1 << 6)
/** PIOC_PPDSR_P5 Pull Down Status. **/
#define PIOC_PPDSR_P5		(1 << 5)
/** PIOC_PPDSR_P4 Pull Down Status. **/
#define PIOC_PPDSR_P4		(1 << 4)
/** PIOC_PPDSR_P3 Pull Down Status. **/
#define PIOC_PPDSR_P3		(1 << 3)
/** PIOC_PPDSR_P2 Pull Down Status. **/
#define PIOC_PPDSR_P2		(1 << 2)
/** PIOC_PPDSR_P1 Pull Down Status. **/
#define PIOC_PPDSR_P1		(1 << 1)
/** PIOC_PPDSR_P0 Pull Down Status. **/
#define PIOC_PPDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_ower OWER Output Write Enable
@{*/

